zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_sg_gc/pic32cm_sg00/pic32cm5112sg00100-pinctrl.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Autogenerated file
 */

#ifndef MICROCHIP_PIC32CM5112SG00100_PINCTRL_H_
#define MICROCHIP_PIC32CM5112SG00100_PINCTRL_H_

#include <dt-bindings/pic32c/pic32cm_sg_gc/common/mchp_pinctrl_pinmux_pic32c.h>

#define PA0_GPIO MCHP_PINMUX(a, 0, gpio, gpio)

#define PA0A_EIC_EXTINT0 MCHP_PINMUX(a, 0, a, periph)

#define PA0D_SERCOM3_PAD1 MCHP_PINMUX(a, 0, d, periph)

#define PA0F_TCC5_WO1 MCHP_PINMUX(a, 0, f, periph)

#define PA0H_CAN1_RX MCHP_PINMUX(a, 0, h, periph)

#define PA0I_CCL0_IN6 MCHP_PINMUX(a, 0, i, periph)

#define PA0P_PTC_DRV4 MCHP_PINMUX(a, 0, p, periph)

#define PA0P_PTC_PTCXY4 MCHP_PINMUX(a, 0, p, periph)

#define PA1_GPIO MCHP_PINMUX(a, 1, gpio, gpio)

#define PA1A_EIC_EXTINT1 MCHP_PINMUX(a, 1, a, periph)

#define PA1B_AC_CMP0 MCHP_PINMUX(a, 1, b, periph)

#define PA1D_SERCOM3_PAD2 MCHP_PINMUX(a, 1, d, periph)

#define PA1F_TCC6_WO0 MCHP_PINMUX(a, 1, f, periph)

#define PA1H_CAN1_TX MCHP_PINMUX(a, 1, h, periph)

#define PA1I_CCL0_IN7 MCHP_PINMUX(a, 1, i, periph)

#define PA1P_PTC_DRV5 MCHP_PINMUX(a, 1, p, periph)

#define PA1P_PTC_PTCXY5 MCHP_PINMUX(a, 1, p, periph)

#define PA2_GPIO MCHP_PINMUX(a, 2, gpio, gpio)

#define PA2A_EIC_EXTINT2 MCHP_PINMUX(a, 2, a, periph)

#define PA2B_AC_CMP1 MCHP_PINMUX(a, 2, b, periph)

#define PA2D_SERCOM3_PAD3 MCHP_PINMUX(a, 2, d, periph)

#define PA2F_TCC6_WO1 MCHP_PINMUX(a, 2, f, periph)

#define PA2I_CCL0_OUT2 MCHP_PINMUX(a, 2, i, periph)

#define PA2P_PTC_DRV6 MCHP_PINMUX(a, 2, p, periph)

#define PA2P_PTC_PTCXY6 MCHP_PINMUX(a, 2, p, periph)

#define PA3_GPIO MCHP_PINMUX(a, 3, gpio, gpio)

#define PA3A_EIC_EXTINT3 MCHP_PINMUX(a, 3, a, periph)

#define PA3B_ADC_ADC0_AIN0 MCHP_PINMUX(a, 3, b, periph)

#define PA3D_SERCOM4_PAD0 MCHP_PINMUX(a, 3, d, periph)

#define PA3P_PTC_DRV7 MCHP_PINMUX(a, 3, p, periph)

#define PA3P_PTC_PTCXY7 MCHP_PINMUX(a, 3, p, periph)

#define PA4_GPIO MCHP_PINMUX(a, 4, gpio, gpio)

#define PA4A_EIC_EXTINT4 MCHP_PINMUX(a, 4, a, periph)

#define PA4B_ADC_ADC0_AIN1 MCHP_PINMUX(a, 4, b, periph)

#define PA4B_ADC_ADC0_ANN0 MCHP_PINMUX(a, 4, b, periph)

#define PA4D_SERCOM4_PAD1 MCHP_PINMUX(a, 4, d, periph)

#define PA4P_PTC_DRV8 MCHP_PINMUX(a, 4, p, periph)

#define PA4P_PTC_PTCXY8 MCHP_PINMUX(a, 4, p, periph)

#define PA5_GPIO MCHP_PINMUX(a, 5, gpio, gpio)

#define PA5A_EIC_EXTINT5 MCHP_PINMUX(a, 5, a, periph)

#define PA5B_ADC_ADC0_AIN2 MCHP_PINMUX(a, 5, b, periph)

#define PA5D_SERCOM4_PAD2 MCHP_PINMUX(a, 5, d, periph)

#define PA5I_CCL1_OUT2 MCHP_PINMUX(a, 5, i, periph)

#define PA5P_PTC_DRV9 MCHP_PINMUX(a, 5, p, periph)

#define PA5P_PTC_PTCXY9 MCHP_PINMUX(a, 5, p, periph)

#define PA6_GPIO MCHP_PINMUX(a, 6, gpio, gpio)

#define PA6A_EIC_EXTINT6 MCHP_PINMUX(a, 6, a, periph)

#define PA6B_ADC_ADC0_AIN3 MCHP_PINMUX(a, 6, b, periph)

#define PA6B_ADC_ADC0_ANN2 MCHP_PINMUX(a, 6, b, periph)

#define PA6D_SERCOM4_PAD3 MCHP_PINMUX(a, 6, d, periph)

#define PA6I_CCL1_IN7 MCHP_PINMUX(a, 6, i, periph)

#define PA6P_PTC_DRV10 MCHP_PINMUX(a, 6, p, periph)

#define PA6P_PTC_PTCXY10 MCHP_PINMUX(a, 6, p, periph)

#define PA7_GPIO MCHP_PINMUX(a, 7, gpio, gpio)

#define PA7A_EIC_EXTINT7 MCHP_PINMUX(a, 7, a, periph)

#define PA7B_AC_AIN0 MCHP_PINMUX(a, 7, b, periph)

#define PA7B_ADC_ADC0_AIN4 MCHP_PINMUX(a, 7, b, periph)

#define PA7P_PTC_DRV11 MCHP_PINMUX(a, 7, p, periph)

#define PA7P_PTC_PTCXY11 MCHP_PINMUX(a, 7, p, periph)

#define PA8_GPIO MCHP_PINMUX(a, 8, gpio, gpio)

#define PA8A_EIC_EXTINT8 MCHP_PINMUX(a, 8, a, periph)

#define PA8B_AC_AIN1 MCHP_PINMUX(a, 8, b, periph)

#define PA8B_ADC_ADC0_AIN5 MCHP_PINMUX(a, 8, b, periph)

#define PA8B_ADC_ADC0_ANN4 MCHP_PINMUX(a, 8, b, periph)

#define PA8P_PTC_DRV12 MCHP_PINMUX(a, 8, p, periph)

#define PA8P_PTC_PTCXY12 MCHP_PINMUX(a, 8, p, periph)

#define PA9_GPIO MCHP_PINMUX(a, 9, gpio, gpio)

#define PA9A_EIC_EXTINT9 MCHP_PINMUX(a, 9, a, periph)

#define PA9B_ADC_ADC0_AIN6 MCHP_PINMUX(a, 9, b, periph)

#define PA9I_CCL1_IN6 MCHP_PINMUX(a, 9, i, periph)

#define PA9P_PTC_DRV13 MCHP_PINMUX(a, 9, p, periph)

#define PA9P_PTC_PTCXY13 MCHP_PINMUX(a, 9, p, periph)

#define PA10_GPIO MCHP_PINMUX(a, 10, gpio, gpio)

#define PA10A_EIC_EXTINT10 MCHP_PINMUX(a, 10, a, periph)

#define PA10F_TCC4_WO0 MCHP_PINMUX(a, 10, f, periph)

#define PA10H_CAN0_RX MCHP_PINMUX(a, 10, h, periph)

#define PA10I_CCL0_IN8 MCHP_PINMUX(a, 10, i, periph)

#define PA10P_PTC_DRV22 MCHP_PINMUX(a, 10, p, periph)

#define PA10P_PTC_PTCXY22 MCHP_PINMUX(a, 10, p, periph)

#define PA11_GPIO MCHP_PINMUX(a, 11, gpio, gpio)

#define PA11A_EIC_EXTINT11 MCHP_PINMUX(a, 11, a, periph)

#define PA11F_TCC4_WO1 MCHP_PINMUX(a, 11, f, periph)

#define PA11H_CAN0_TX MCHP_PINMUX(a, 11, h, periph)

#define PA11I_CCL1_IN8 MCHP_PINMUX(a, 11, i, periph)

#define PA11P_PTC_DRV23 MCHP_PINMUX(a, 11, p, periph)

#define PA11P_PTC_PTCXY23 MCHP_PINMUX(a, 11, p, periph)

#define PA12_GPIO MCHP_PINMUX(a, 12, gpio, gpio)

#define PA12A_EIC_EXTINT12 MCHP_PINMUX(a, 12, a, periph)

#define PA12I_CCL1_IN8 MCHP_PINMUX(a, 12, i, periph)

#define PA12P_PTC_DRV24 MCHP_PINMUX(a, 12, p, periph)

#define PA12P_PTC_PTCXY24 MCHP_PINMUX(a, 12, p, periph)

#define PA13_GPIO MCHP_PINMUX(a, 13, gpio, gpio)

#define PA13A_EIC_EXTINT13 MCHP_PINMUX(a, 13, a, periph)

#define PA13B_AC_CMP0 MCHP_PINMUX(a, 13, b, periph)

#define PA13P_PTC_DRV25 MCHP_PINMUX(a, 13, p, periph)

#define PA13P_PTC_PTCXY25 MCHP_PINMUX(a, 13, p, periph)

#define PA14_GPIO MCHP_PINMUX(a, 14, gpio, gpio)

#define PA14A_EIC_EXTINT14 MCHP_PINMUX(a, 14, a, periph)

#define PA14D_SERCOM4_PAD3 MCHP_PINMUX(a, 14, d, periph)

#define PA14I_CCL0_IN6 MCHP_PINMUX(a, 14, i, periph)

#define PA14P_PTC_DRV32 MCHP_PINMUX(a, 14, p, periph)

#define PA14P_PTC_PTCXY32 MCHP_PINMUX(a, 14, p, periph)

#define PA15_GPIO MCHP_PINMUX(a, 15, gpio, gpio)

#define PA15A_EIC_EXTINT15 MCHP_PINMUX(a, 15, a, periph)

#define PA15D_SERCOM5_PAD3 MCHP_PINMUX(a, 15, d, periph)

#define PA15I_CCL0_IN7 MCHP_PINMUX(a, 15, i, periph)

#define PA15P_PTC_DRV33 MCHP_PINMUX(a, 15, p, periph)

#define PA15P_PTC_PTCXY33 MCHP_PINMUX(a, 15, p, periph)

#define PA16_GPIO MCHP_PINMUX(a, 16, gpio, gpio)

#define PA16A_EIC_EXTINT0 MCHP_PINMUX(a, 16, a, periph)

#define PA16D_SERCOM5_PAD0 MCHP_PINMUX(a, 16, d, periph)

#define PA16I_CCL1_IN6 MCHP_PINMUX(a, 16, i, periph)

#define PA16P_PTC_DRV34 MCHP_PINMUX(a, 16, p, periph)

#define PA16P_PTC_PTCXY34 MCHP_PINMUX(a, 16, p, periph)

#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

#define PA17D_SERCOM5_PAD1 MCHP_PINMUX(a, 17, d, periph)

#define PA17I_CCL1_IN7 MCHP_PINMUX(a, 17, i, periph)

#define PA17P_PTC_DRV35 MCHP_PINMUX(a, 17, p, periph)

#define PA17P_PTC_PTCXY35 MCHP_PINMUX(a, 17, p, periph)

#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

#define PA18D_SERCOM5_PAD2 MCHP_PINMUX(a, 18, d, periph)

#define PA18I_CCL0_IN8 MCHP_PINMUX(a, 18, i, periph)

#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

#define PA19F_TCC0_WO0 MCHP_PINMUX(a, 19, f, periph)

#define PA19I_CCL0_OUT2 MCHP_PINMUX(a, 19, i, periph)

#define PA20_GPIO MCHP_PINMUX(a, 20, gpio, gpio)

#define PA20A_EIC_EXTINT4 MCHP_PINMUX(a, 20, a, periph)

#define PA20F_TCC0_WO1 MCHP_PINMUX(a, 20, f, periph)

#define PA20I_CCL1_OUT2 MCHP_PINMUX(a, 20, i, periph)

#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

#define PB0B_AC_AIN2 MCHP_PINMUX(b, 0, b, periph)

#define PB0B_ADC_ADC0_AIN7 MCHP_PINMUX(b, 0, b, periph)

#define PB0I_CCL1_OUT3 MCHP_PINMUX(b, 0, i, periph)

#define PB0P_PTC_DRV14 MCHP_PINMUX(b, 0, p, periph)

#define PB0P_PTC_PTCXY14 MCHP_PINMUX(b, 0, p, periph)

#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

#define PB3B_AC_AIN3 MCHP_PINMUX(b, 3, b, periph)

#define PB3B_ADC_ADC0_AIN8 MCHP_PINMUX(b, 3, b, periph)

#define PB3D_SERCOM5_PAD0 MCHP_PINMUX(b, 3, d, periph)

#define PB3I_CCL1_IN10 MCHP_PINMUX(b, 3, i, periph)

#define PB3P_PTC_DRV15 MCHP_PINMUX(b, 3, p, periph)

#define PB3P_PTC_PTCXY15 MCHP_PINMUX(b, 3, p, periph)

#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

#define PB4B_ADC_ADC0_AIN9 MCHP_PINMUX(b, 4, b, periph)

#define PB4D_SERCOM5_PAD1 MCHP_PINMUX(b, 4, d, periph)

#define PB4I_CCL1_IN9 MCHP_PINMUX(b, 4, i, periph)

#define PB4P_PTC_DRV16 MCHP_PINMUX(b, 4, p, periph)

#define PB4P_PTC_PTCXY16 MCHP_PINMUX(b, 4, p, periph)

#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

#define PB5B_ADC_ADC0_AIN10 MCHP_PINMUX(b, 5, b, periph)

#define PB5D_SERCOM5_PAD2 MCHP_PINMUX(b, 5, d, periph)

#define PB5I_CCL0_IN9 MCHP_PINMUX(b, 5, i, periph)

#define PB5P_PTC_DRV17 MCHP_PINMUX(b, 5, p, periph)

#define PB5P_PTC_PTCXY17 MCHP_PINMUX(b, 5, p, periph)

#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

#define PB6B_ADC_ADC0_AIN11 MCHP_PINMUX(b, 6, b, periph)

#define PB6D_SERCOM5_PAD3 MCHP_PINMUX(b, 6, d, periph)

#define PB6I_CCL0_IN10 MCHP_PINMUX(b, 6, i, periph)

#define PB6K_GCLK_IO0 MCHP_PINMUX(b, 6, k, periph)

#define PB6P_PTC_DRV18 MCHP_PINMUX(b, 6, p, periph)

#define PB6P_PTC_PTCXY18 MCHP_PINMUX(b, 6, p, periph)

#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

#define PB7A_EIC_EXTINT8 MCHP_PINMUX(b, 7, a, periph)

#define PB7B_AC_CMP1 MCHP_PINMUX(b, 7, b, periph)

#define PB7I_CCL1_IN11 MCHP_PINMUX(b, 7, i, periph)

#define PB7P_PTC_DRV26 MCHP_PINMUX(b, 7, p, periph)

#define PB7P_PTC_PTCXY26 MCHP_PINMUX(b, 7, p, periph)

#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

#define PB8A_EIC_EXTINT9 MCHP_PINMUX(b, 8, a, periph)

#define PB8F_TCC2_WO1 MCHP_PINMUX(b, 8, f, periph)

#define PB8I_CCL1_IN11 MCHP_PINMUX(b, 8, i, periph)

#define PB8P_PTC_DRV27 MCHP_PINMUX(b, 8, p, periph)

#define PB8P_PTC_PTCXY27 MCHP_PINMUX(b, 8, p, periph)

#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

#define PB9A_EIC_EXTINT10 MCHP_PINMUX(b, 9, a, periph)

#define PB9F_TCC2_WO0 MCHP_PINMUX(b, 9, f, periph)

#define PB9K_GCLK_IO7 MCHP_PINMUX(b, 9, k, periph)

#define PB9P_PTC_DRV28 MCHP_PINMUX(b, 9, p, periph)

#define PB9P_PTC_PTCXY28 MCHP_PINMUX(b, 9, p, periph)

#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

#define PB10A_EIC_EXTINT11 MCHP_PINMUX(b, 10, a, periph)

#define PB10I_CCL0_IN11 MCHP_PINMUX(b, 10, i, periph)

#define PB10K_GCLK_IO6 MCHP_PINMUX(b, 10, k, periph)

#define PB10P_PTC_DRV29 MCHP_PINMUX(b, 10, p, periph)

#define PB10P_PTC_PTCXY29 MCHP_PINMUX(b, 10, p, periph)

#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

#define PB11A_EIC_EXTINT12 MCHP_PINMUX(b, 11, a, periph)

#define PB11F_TCC0_WO0 MCHP_PINMUX(b, 11, f, periph)

#define PB11I_CCL1_IN9 MCHP_PINMUX(b, 11, i, periph)

#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

#define PB12A_EIC_EXTINT2 MCHP_PINMUX(b, 12, a, periph)

#define PB12F_TCC0_WO1 MCHP_PINMUX(b, 12, f, periph)

#define PB12I_CCL0_IN9 MCHP_PINMUX(b, 12, i, periph)

#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

#define PB13A_EIC_EXTINT14 MCHP_PINMUX(b, 13, a, periph)

#define PB13F_TCC3_WO0 MCHP_PINMUX(b, 13, f, periph)

#define PB13I_CCL1_IN10 MCHP_PINMUX(b, 13, i, periph)

#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

#define PB14A_EIC_EXTINT15 MCHP_PINMUX(b, 14, a, periph)

#define PB14F_TCC3_WO1 MCHP_PINMUX(b, 14, f, periph)

#define PB14I_CCL0_IN10 MCHP_PINMUX(b, 14, i, periph)

#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

#define PB15A_EIC_EXTINT0 MCHP_PINMUX(b, 15, a, periph)

#define PB15D_SERCOM0_PAD0 MCHP_PINMUX(b, 15, d, periph)

#define PB15I_CCL0_IN11 MCHP_PINMUX(b, 15, i, periph)

#define PB15K_GCLK_IO0 MCHP_PINMUX(b, 15, k, periph)

#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

#define PB16A_EIC_EXTINT1 MCHP_PINMUX(b, 16, a, periph)

#define PB16D_SERCOM0_PAD1 MCHP_PINMUX(b, 16, d, periph)

#define PB16I_CCL0_OUT3 MCHP_PINMUX(b, 16, i, periph)

#define PB16K_GCLK_IO6 MCHP_PINMUX(b, 16, k, periph)

#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

#define PB17A_EIC_EXTINT2 MCHP_PINMUX(b, 17, a, periph)

#define PB17D_SERCOM0_PAD2 MCHP_PINMUX(b, 17, d, periph)

#define PB17I_CCL1_OUT3 MCHP_PINMUX(b, 17, i, periph)

#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

#define PC0D_SERCOM0_PAD0 MCHP_PINMUX(c, 0, d, periph)

#define PC0F_TCC0_WO0 MCHP_PINMUX(c, 0, f, periph)

#define PC0I_CCL0_OUT3 MCHP_PINMUX(c, 0, i, periph)

#define PC0K_GCLK_IO1 MCHP_PINMUX(c, 0, k, periph)

#define PC0P_PTC_DRV19 MCHP_PINMUX(c, 0, p, periph)

#define PC0P_PTC_PTCXY19 MCHP_PINMUX(c, 0, p, periph)

#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

#define PC1D_SERCOM0_PAD1 MCHP_PINMUX(c, 1, d, periph)

#define PC1F_TCC0_WO1 MCHP_PINMUX(c, 1, f, periph)

#define PC1H_CAN0_RX MCHP_PINMUX(c, 1, h, periph)

#define PC1I_CCL0_IN0 MCHP_PINMUX(c, 1, i, periph)

#define PC1K_GCLK_IO2 MCHP_PINMUX(c, 1, k, periph)

#define PC1P_PTC_DRV20 MCHP_PINMUX(c, 1, p, periph)

#define PC1P_PTC_PTCXY20 MCHP_PINMUX(c, 1, p, periph)

#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

#define PC2A_EIC_EXTINT2 MCHP_PINMUX(c, 2, a, periph)

#define PC2D_SERCOM0_PAD2 MCHP_PINMUX(c, 2, d, periph)

#define PC2F_TCC1_WO0 MCHP_PINMUX(c, 2, f, periph)

#define PC2H_CAN0_TX MCHP_PINMUX(c, 2, h, periph)

#define PC2I_CCL0_IN1 MCHP_PINMUX(c, 2, i, periph)

#define PC2K_GCLK_IO3 MCHP_PINMUX(c, 2, k, periph)

#define PC2P_PTC_DRV21 MCHP_PINMUX(c, 2, p, periph)

#define PC2P_PTC_PTCXY21 MCHP_PINMUX(c, 2, p, periph)

#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

#define PC3D_SERCOM0_PAD3 MCHP_PINMUX(c, 3, d, periph)

#define PC3F_TCC1_WO1 MCHP_PINMUX(c, 3, f, periph)

#define PC3I_CCL0_OUT0 MCHP_PINMUX(c, 3, i, periph)

#define PC3K_GCLK_IO4 MCHP_PINMUX(c, 3, k, periph)

#define PC3P_PTC_ECI0 MCHP_PINMUX(c, 3, p, periph)

#define PC4_GPIO MCHP_PINMUX(c, 4, gpio, gpio)

#define PC4A_EIC_EXTINT4 MCHP_PINMUX(c, 4, a, periph)

#define PC4D_SERCOM2_PAD0 MCHP_PINMUX(c, 4, d, periph)

#define PC4F_TCC2_WO0 MCHP_PINMUX(c, 4, f, periph)

#define PC4I_CCL1_IN0 MCHP_PINMUX(c, 4, i, periph)

#define PC4K_GCLK_IO5 MCHP_PINMUX(c, 4, k, periph)

#define PC4P_PTC_ECI1 MCHP_PINMUX(c, 4, p, periph)

#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

#define PC5A_EIC_EXTINT5 MCHP_PINMUX(c, 5, a, periph)

#define PC5D_SERCOM1_PAD3 MCHP_PINMUX(c, 5, d, periph)

#define PC5F_TCC2_WO1 MCHP_PINMUX(c, 5, f, periph)

#define PC5H_CAN1_RX MCHP_PINMUX(c, 5, h, periph)

#define PC5I_CCL1_IN1 MCHP_PINMUX(c, 5, i, periph)

#define PC5K_GCLK_IO1 MCHP_PINMUX(c, 5, k, periph)

#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

#define PC6D_SERCOM1_PAD2 MCHP_PINMUX(c, 6, d, periph)

#define PC6H_CAN1_TX MCHP_PINMUX(c, 6, h, periph)

#define PC6I_CCL1_OUT0 MCHP_PINMUX(c, 6, i, periph)

#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

#define PC9A_EIC_EXTINT9 MCHP_PINMUX(c, 9, a, periph)

#define PC9F_TCC1_WO0 MCHP_PINMUX(c, 9, f, periph)

#define PC9I_CCL0_IN2 MCHP_PINMUX(c, 9, i, periph)

#define PC9K_GCLK_IO0 MCHP_PINMUX(c, 9, k, periph)

#define PC9P_PTC_DRV30 MCHP_PINMUX(c, 9, p, periph)

#define PC9P_PTC_PTCXY30 MCHP_PINMUX(c, 9, p, periph)

#define PC10_GPIO MCHP_PINMUX(c, 10, gpio, gpio)

#define PC10A_EIC_EXTINT10 MCHP_PINMUX(c, 10, a, periph)

#define PC10F_TCC1_WO1 MCHP_PINMUX(c, 10, f, periph)

#define PC10I_CCL1_IN2 MCHP_PINMUX(c, 10, i, periph)

#define PC10K_GCLK_IO1 MCHP_PINMUX(c, 10, k, periph)

#define PC10P_PTC_DRV31 MCHP_PINMUX(c, 10, p, periph)

#define PC10P_PTC_PTCXY31 MCHP_PINMUX(c, 10, p, periph)

#define PC11_GPIO MCHP_PINMUX(c, 11, gpio, gpio)

#define PC11A_EIC_EXTINT11 MCHP_PINMUX(c, 11, a, periph)

#define PC11D_SERCOM0_PAD3 MCHP_PINMUX(c, 11, d, periph)

#define PC11I_CCL1_IN0 MCHP_PINMUX(c, 11, i, periph)

#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

#define PC12A_EIC_EXTINT12 MCHP_PINMUX(c, 12, a, periph)

#define PC12D_SERCOM1_PAD3 MCHP_PINMUX(c, 12, d, periph)

#define PC12I_CCL0_IN0 MCHP_PINMUX(c, 12, i, periph)

#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

#define PC13D_SERCOM1_PAD2 MCHP_PINMUX(c, 13, d, periph)

#define PC13I_CCL0_OUT0 MCHP_PINMUX(c, 13, i, periph)

#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

#define PC14D_SERCOM1_PAD1 MCHP_PINMUX(c, 14, d, periph)

#define PC14I_CCL0_IN1 MCHP_PINMUX(c, 14, i, periph)

#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

#define PC15D_SERCOM1_PAD0 MCHP_PINMUX(c, 15, d, periph)

#define PC15I_CCL0_IN2 MCHP_PINMUX(c, 15, i, periph)

#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

#define PC16D_SERCOM2_PAD3 MCHP_PINMUX(c, 16, d, periph)

#define PC16I_CCL1_IN2 MCHP_PINMUX(c, 16, i, periph)

#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

#define PC17D_SERCOM2_PAD2 MCHP_PINMUX(c, 17, d, periph)

#define PC17I_CCL1_IN1 MCHP_PINMUX(c, 17, i, periph)

#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

#define PC18A_EIC_EXTINT2 MCHP_PINMUX(c, 18, a, periph)

#define PC18D_SERCOM2_PAD1 MCHP_PINMUX(c, 18, d, periph)

#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

#define PC19D_SERCOM2_PAD0 MCHP_PINMUX(c, 19, d, periph)

#define PC19I_CCL1_OUT0 MCHP_PINMUX(c, 19, i, periph)

#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

#define PD0A_EIC_NMI MCHP_PINMUX(d, 0, a, periph)

#define PD0D_SERCOM1_PAD1 MCHP_PINMUX(d, 0, d, periph)

#define PD0F_TCC3_WO0 MCHP_PINMUX(d, 0, f, periph)

#define PD0I_CCL0_IN3 MCHP_PINMUX(d, 0, i, periph)

#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

#define PD1D_SERCOM1_PAD0 MCHP_PINMUX(d, 1, d, periph)

#define PD1F_TCC3_WO1 MCHP_PINMUX(d, 1, f, periph)

#define PD1H_USB_SOF MCHP_PINMUX(d, 1, h, periph)

#define PD1I_CCL0_IN4 MCHP_PINMUX(d, 1, i, periph)

#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

#define PD2H_USB_USBDM MCHP_PINMUX(d, 2, h, periph)

#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

#define PD3H_USB_USBDP MCHP_PINMUX(d, 3, h, periph)

#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

#define PD4A_EIC_EXTINT2 MCHP_PINMUX(d, 4, a, periph)

#define PD4K_GCLK_IO1 MCHP_PINMUX(d, 4, k, periph)

#define PD5_GPIO MCHP_PINMUX(d, 5, gpio, gpio)

#define PD5A_EIC_EXTINT3 MCHP_PINMUX(d, 5, a, periph)

#define PD5K_GCLK_IO0 MCHP_PINMUX(d, 5, k, periph)

#define PD6_GPIO MCHP_PINMUX(d, 6, gpio, gpio)

#define PD6D_SERCOM2_PAD1 MCHP_PINMUX(d, 6, d, periph)

#define PD6H_CAN0_RX MCHP_PINMUX(d, 6, h, periph)

#define PD6I_CCL1_IN3 MCHP_PINMUX(d, 6, i, periph)

#define PD6P_PTC_DRV0 MCHP_PINMUX(d, 6, p, periph)

#define PD6P_PTC_PTCXY0 MCHP_PINMUX(d, 6, p, periph)

#define PD7_GPIO MCHP_PINMUX(d, 7, gpio, gpio)

#define PD7A_EIC_EXTINT4 MCHP_PINMUX(d, 7, a, periph)

#define PD7D_SERCOM2_PAD2 MCHP_PINMUX(d, 7, d, periph)

#define PD7F_TCC4_WO0 MCHP_PINMUX(d, 7, f, periph)

#define PD7I_CCL1_IN4 MCHP_PINMUX(d, 7, i, periph)

#define PD7P_PTC_DRV1 MCHP_PINMUX(d, 7, p, periph)

#define PD7P_PTC_PTCXY1 MCHP_PINMUX(d, 7, p, periph)

#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

#define PD8A_EIC_EXTINT5 MCHP_PINMUX(d, 8, a, periph)

#define PD8D_SERCOM2_PAD3 MCHP_PINMUX(d, 8, d, periph)

#define PD8F_TCC4_WO1 MCHP_PINMUX(d, 8, f, periph)

#define PD8H_CAN0_TX MCHP_PINMUX(d, 8, h, periph)

#define PD8I_CCL0_OUT1 MCHP_PINMUX(d, 8, i, periph)

#define PD8P_PTC_DRV2 MCHP_PINMUX(d, 8, p, periph)

#define PD8P_PTC_PTCXY2 MCHP_PINMUX(d, 8, p, periph)

#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

#define PD9A_EIC_EXTINT6 MCHP_PINMUX(d, 9, a, periph)

#define PD9D_SERCOM3_PAD0 MCHP_PINMUX(d, 9, d, periph)

#define PD9F_TCC5_WO0 MCHP_PINMUX(d, 9, f, periph)

#define PD9I_CCL1_OUT1 MCHP_PINMUX(d, 9, i, periph)

#define PD9P_PTC_DRV3 MCHP_PINMUX(d, 9, p, periph)

#define PD9P_PTC_PTCXY3 MCHP_PINMUX(d, 9, p, periph)

#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

#define PD10A_EIC_EXTINT8 MCHP_PINMUX(d, 10, a, periph)

#define PD10D_SERCOM1_PAD2 MCHP_PINMUX(d, 10, d, periph)

#define PD10F_TCC5_WO0 MCHP_PINMUX(d, 10, f, periph)

#define PD10I_CCL0_IN5 MCHP_PINMUX(d, 10, i, periph)

#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

#define PD11A_EIC_EXTINT9 MCHP_PINMUX(d, 11, a, periph)

#define PD11D_SERCOM1_PAD3 MCHP_PINMUX(d, 11, d, periph)

#define PD11F_TCC5_WO1 MCHP_PINMUX(d, 11, f, periph)

#define PD11I_CCL1_IN5 MCHP_PINMUX(d, 11, i, periph)

#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

#define PD12A_EIC_EXTINT10 MCHP_PINMUX(d, 12, a, periph)

#define PD12F_TCC6_WO0 MCHP_PINMUX(d, 12, f, periph)

#define PD12H_CAN1_RX MCHP_PINMUX(d, 12, h, periph)

#define PD12I_CCL1_IN5 MCHP_PINMUX(d, 12, i, periph)

#define PD13_GPIO MCHP_PINMUX(d, 13, gpio, gpio)

#define PD13A_EIC_EXTINT11 MCHP_PINMUX(d, 13, a, periph)

#define PD13F_TCC6_WO1 MCHP_PINMUX(d, 13, f, periph)

#define PD13H_CAN1_TX MCHP_PINMUX(d, 13, h, periph)

#define PD14_GPIO MCHP_PINMUX(d, 14, gpio, gpio)

#define PD14A_EIC_EXTINT12 MCHP_PINMUX(d, 14, a, periph)

#define PD14D_SERCOM3_PAD3 MCHP_PINMUX(d, 14, d, periph)

#define PD14I_CCL0_OUT1 MCHP_PINMUX(d, 14, i, periph)

#define PD15_GPIO MCHP_PINMUX(d, 15, gpio, gpio)

#define PD15A_EIC_EXTINT13 MCHP_PINMUX(d, 15, a, periph)

#define PD15D_SERCOM3_PAD1 MCHP_PINMUX(d, 15, d, periph)

#define PD15I_CCL1_OUT1 MCHP_PINMUX(d, 15, i, periph)

#define PD16_GPIO MCHP_PINMUX(d, 16, gpio, gpio)

#define PD16A_EIC_EXTINT14 MCHP_PINMUX(d, 16, a, periph)

#define PD16D_SERCOM3_PAD0 MCHP_PINMUX(d, 16, d, periph)

#define PD16I_CCL1_IN4 MCHP_PINMUX(d, 16, i, periph)

#define PD17_GPIO MCHP_PINMUX(d, 17, gpio, gpio)

#define PD17A_EIC_EXTINT15 MCHP_PINMUX(d, 17, a, periph)

#define PD17D_SERCOM3_PAD2 MCHP_PINMUX(d, 17, d, periph)

#define PD17I_CCL0_IN4 MCHP_PINMUX(d, 17, i, periph)

#define PD18_GPIO MCHP_PINMUX(d, 18, gpio, gpio)

#define PD18A_EIC_EXTINT0 MCHP_PINMUX(d, 18, a, periph)

#define PD18D_SERCOM4_PAD2 MCHP_PINMUX(d, 18, d, periph)

#define PD18I_CCL0_IN3 MCHP_PINMUX(d, 18, i, periph)

#define PD19_GPIO MCHP_PINMUX(d, 19, gpio, gpio)

#define PD19A_EIC_EXTINT1 MCHP_PINMUX(d, 19, a, periph)

#define PD19D_SERCOM4_PAD0 MCHP_PINMUX(d, 19, d, periph)

#define PD19I_CCL0_IN5 MCHP_PINMUX(d, 19, i, periph)

#define PD20_GPIO MCHP_PINMUX(d, 20, gpio, gpio)

#define PD20A_EIC_EXTINT2 MCHP_PINMUX(d, 20, a, periph)

#define PD20D_SERCOM4_PAD1 MCHP_PINMUX(d, 20, d, periph)

#define PD20I_CCL1_IN3 MCHP_PINMUX(d, 20, i, periph)

#endif /* MICROCHIP_PIC32CM5112SG00100_PINCTRL_H_ */
